Repository: bdbcat/celestial_navigation_pi
Catalog: po/*.po
Languages: id_id, ru_ru

source: Type
id_id: Jenis
ru_ru: Тип

source: Body
id_id: Badan
ru_ru: Небесное тело

source: Time (UTC)
id_id: Waktu (UTC)
ru_ru: Время (UTC)

source: Measurement
id_id: Pengukuran
ru_ru: Измерения

source: Color
id_id: Warna
ru_ru: Цвет

source: Failed to load file.
id_id: Memuat berkas gagal.
ru_ru: Не удалось загрузить файл.

source: Invalid xml file
id_id: File xml tidak sesuai
ru_ru: Недопустимый Xml-файл

source: Unrecognized xml node
id_id: Simpul xml yang tidak dikenal
ru_ru: Нераспознанный Xml-узел

source: Weather Routing
id_id: Pengaturan Cuaca
ru_ru: Учет данных о погоде при планировании маршрута

source: Failed to save xml file:
id_id: Menyimpan berkas xml gagal:
ru_ru: Не удалось сохранить Xml-файл:

source: Celestial Navigation
id_id: Navigasi Angkasa
ru_ru: Мореходная астрономия

source: Time Correction
id_id: Koreksi Waktu
ru_ru: Коррекция времени

source: Sun
id_id: Minggu
ru_ru: Солнце

source: Are you sure you want to delete all sights?
id_id: Apakah anda yakin ingin menghapus semua pemandangan?
ru_ru: Вы уверены, что хотите удалить все наблюдения?

source: Show
id_id: Tampilkan
ru_ru: Показать

source: Hide
id_id: Sembunyikan
ru_ru: Скрыть

source: New
id_id: Baru
ru_ru: Новый

source: Edit
id_id: Ubah
ru_ru: Правка

source: Delete
id_id: Hapus
ru_ru: Удалить

source: Delete All
id_id: Menghapus semua
ru_ru: Удалить все

source: Fix
id_id: Memperbaiki
ru_ru: Исправить

source: Clock Offset
id_id: Jam offset
ru_ru: Уход эталона времени

source: Information
id_id: Informasi
ru_ru: Информация

source: Altitude
id_id: Ketinggian
ru_ru: Высота

source: Azimuth
id_id: Azimut
ru_ru: Азимут

source: Lunar
ru_ru: Луны

source: Magnetic Azimuth
id_id: Azimut Magnetik
ru_ru: Магнитный азимут

source: Celestial Body
id_id: Tubuh angkasa
ru_ru: Небесное тело

source: Find
id_id: Cari
ru_ru: Найти

source: Limb
id_id: Dahan
ru_ru: Диск

source: Lower
id_id: Lebih rendah
ru_ru: Ниже

source: Center
id_id: Tengah
ru_ru: По центру

source: Upper
id_id: Atas
ru_ru: Выше

source: Degrees
id_id: Derajat
ru_ru: Градусов

source: Minutes
id_id: Menit
ru_ru: Минут

source: Minutes Certainty
id_id: Kepastian Menit
ru_ru: Достоверность минут

source: Lunar Altitude
id_id: Ketinggian Lunar
ru_ru: Высота Луны

source: Body Altitude
id_id: Ketinggian Tubuh
ru_ru: Высота небесного тела

source: Sight
id_id: Melihat
ru_ru: Наблюдение

source: Hours
id_id: Jam
ru_ru: Часов

source: Seconds
id_id: Detik
ru_ru: Секунд

source: Certainty
id_id: Kepastian
ru_ru: Достоверность

source: Time
id_id: Waktu
ru_ru: Время

source: Distance
id_id: Jarak
ru_ru: Расстояние

source: Nm
ru_ru: миль

source: Bearing
id_id: Bantalan
ru_ru: Азимут

source: Magnetic Bearing
id_id: Bantalan magnetik
ru_ru: Магнитный азимут

source: DR Shift
id_id: DR Bergeser
ru_ru: Ошибка счисления

source: Transparency
id_id: Transparansi
ru_ru: Прозрачность

source: Config
id_id: Konfigurasi
ru_ru: Настройка

source: Eye Height
id_id: Tinggi mata
ru_ru: Высота глаз

source: Meters
id_id: Meter
ru_ru: М

source: Temperature
id_id: Temperatur
ru_ru: Температура

source: Celcius
ru_ru: Цельсия

source: Pressure
id_id: Tekanan
ru_ru: Давление

source: MilliBars
ru_ru: мбар

source: Index Error
id_id: Kesalahan indeks
ru_ru: Ошибка индекса

source: Set As Defaults
id_id: Ditetapkan Sebagai Default
ru_ru: Установить по умолчанию

source: Parameters
id_id: Parameter
ru_ru: Параметры

source: Calculations
id_id: Perhitungan
ru_ru: Расчеты

source: Shift all visible Sights
id_id: Pergeseran semua Pemandangan yang terlihat
ru_ru: Сместить все текущие наблюдения

source: Latitude
id_id: Garis Lintang
ru_ru: Широта

source: Longitude
id_id: Garis Bujur
ru_ru: Долгота

source: Done
id_id: Selesai
ru_ru: Готово

source: Magnetic
id_id: Magnetik
ru_ru: Магнитн.

source: Fix From Visible Sights
id_id: Perbaiki Dari Pemandangan Terlihat
ru_ru: Исправление по данным текущих наблюдений

source: N/A
ru_ru: Н/Д

source: N/A
ru_ru: Н/Д

source: Error
id_id: Kesalahan
ru_ru: Oшибка

source: N/A
ru_ru: Н/Д

source: Initial
id_id: Awal
ru_ru: Исходные

source: Alg
ru_ru: Алг

source: Plane
id_id: Pesawat
ru_ru: Плоскость

source: Sphere
id_id: Lingkup
ru_ru: Сфера

source: Cone
id_id: Kerucut
ru_ru: Конус

source: Cone 2
id_id: Kerucut 2
ru_ru: Конус 2

source: Go
id_id: Pergi
ru_ru: Перейти

source: Clock Correction
id_id: Koreksi jam
ru_ru: Коррекция часов

source: Celestial Navigation Sights
id_id: Pemandangan navigasi langit
ru_ru: Астрономические наблюдения

source: Sight Properties
id_id: Properti Tautan
ru_ru: Параметры наблюдения

source: Dead Reckoning shift
id_id: Mati pergeseran Reckoning
ru_ru: Смещение от счисления

source: Find Celestial Body
id_id: Menemukan Benda Angkasa
ru_ru: Поиск небесного тела

source: Astrolab failed, data unavailable:
id_id: Astrolab gagal, data tidak tersedia:
ru_ru: Ошибка Astrolab, нет данных:

source: Did you forget to install vsop87d.txt?
id_id: Apakah kamu lupa untuk menginstal vsop87d.txt?
ru_ru: Вы забыли установить vsop87d.txt?

source: The plugin will not work correctly
id_id: Plugin tidak akan bekerja dengan benar
ru_ru: Плагин не будет работать правильно

source: Failure Alert
id_id: Kegagalan peringatan
ru_ru: Оповещение о сбое

source: Applying clock correction of %d seconds
id_id: Menerapkan koreksi jam dari %d detik
ru_ru: Применение коррекции времени на %d секунд

source: Almanac Data For
id_id: Data Almanak Untuk
ru_ru: Данные альманаха для

source: Geographical Position (lat, lon) = %.4f %.4f GHAAST = %.0f %.1f' SHA = %.0f %.1f' GHA = %.0f %.1f' Dec = %c %.0f %.1f' SD = %.1f' HP = %.1f'
id_id: Posisi geografis (lat, lon) = %.4f %.4f GHAAST = %.0f %.1f' SHA = %.0f %.1f' GHA = %.0f %.1f ' Dec = %c %.0f %.1f' SD = %.1f' HP = %.1f'
ru_ru: Географические координаты (lat, lon) = %.4f %.4f GHAAST = %.0f %.1f' SHA = %.0f %.1f' GHA = %.0f %.1f' Dec = %c %.0f %.1f' SD = %.1f' HP = %.1f'

source: Formulas used to calculate sight
id_id: Rumus yang digunakan untuk menghitung sight
ru_ru: Формулы, используемые для вычисления наблюдений

source: Index Error is %.4f degrees
id_id: Kesalahan indeks adalah %.4f derajat
ru_ru: Ошибка индекса на %.4f градусов

source: Eye Height is %.4f meters Height Correction Degrees = 1.758*sqrt(%.4f) / 60.0 Height Correction Degrees = %.4f
id_id: Tinggi mata adalah %.4f meter Tinggi Koreksi derajat = 1.758*sqrt(%.4f) / 60,0 Tinggi Koreksi derajat = %.4f
ru_ru: Высота глаз-%.4f метров Поправка на высоту, градусов = 1.758*sqrt(%.4f) / 60.0 Поправка на высоту, градусов = %.4f

source: Apparent Altitude (Ha) ApparentAltitude = Measurement - IndexCorrection - EyeHeightCorrection ApparentAltitude = %.4f - %.4f - %.4f ApparentAltitude = %.4f
id_id: Ketinggian Nampak (HA) KetinggianNampak = Pengukuran - KoreksiIndeks - KoreksiTinggiMata KetinggianNampak = %.4f - %.4f - %.4f KetinggianNampak = %.4f
ru_ru: Истинная Высота (Ha) ИстиннаяВысота = Измерение - ПоправкаСекстанта - ИсправлениеВысотыГлаз ИстиннаяВысота = %.4f - %.4f - %.4f ИстиннаяВысота = %.4f

source: Refraction Correction x = tan(Pi/180*ApparentAltitude + 4.848e-2*(Pi/180) / (tan(Pi/180*ApparentAltitude) + .028)) x = tan(Pi/180*%.4f + 4.848e-2*(Pi/180) / (tan(Pi/180*%.4f) + .028)) x = %.4f
id_id: Koreksi Refraksi x = tan(Pi/180*KetinggianNampak + 4.848e-2*(Pi/180) / (tan(Pi/180*KetinggianNampak) + .028)) x = tan(Pi/180*%.4f + 4.848e-2*(Pi/180) / (tan(Pi/180*%.4f) + .028)) x = %.4f
ru_ru: Коррекция рефракции x = tan(Pi/180*ИстиннаяВысота + 4.848e-2*(Pi/180) / (tan(Pi/180*ИстиннаяВысота) + .028)) x = tan(Pi/180*%.4f + 4.848e-2*(Pi/180) / (tan(Pi/180*%.4f) + .028)) x = %.4f

source: RefractionCorrection = .267 * Pressure / (x*(Temperature + 273.15)) / 60.0 RefractionCorrection = .267 * %.4f / (x*(%.4f + 273.15)) / 60.0 RefractionCorrection = %.4f
id_id: KoreksiRefraksi = .267 * Tekanan / (x*(Suhu + 273.15)) / 60.0 KoreksiRefraksi = .267 * %.4f / (x*(%.4f + 273.15)) / 60.0 KoreksiRefraksi = %.4f
ru_ru: КоррекцияРефракции = .267 * Давление / (x*(Температура + 273.15)) / 60.0 КоррекцияРефракции = .267 * %.4f / (x*(%.4f + 273.15)) / 60.0 КоррекцияРефракции = %.4f

source: Sun selected, Limb Correction ra = %.4f, lc = 0.266564/ra = %.4f
id_id: Matahari dipilih, Koreksi Dahan ra = %.4f, lc = 0.266564/ra = %.4f
ru_ru: Выбрано Солнце, коррекция диска ra = %.4f, lc = 0.266564/ra = %.4f

source: Moon selected, Limb Correction SD = %.4f lc = 180/Pi * asin(Pi/180*SD) lc = %.4f
id_id: Bulan dipilih, Koreksi Dahan SD = %.4f lc = 180/Pi * asin(Pi/180*SD) lc = %.4f
ru_ru: Выбрана Луна, Коррекция Диска SD = %.4f lc = 180/Pi * asin(Pi/180*SD) lc = %.4f

source: Upper Limb
id_id: Tungkai Atas
ru_ru: Верхний край диска

source: Lower Limb
id_id: Tungkai Bawah
ru_ru: Нижний край диска

source: LimbCorrection = %.4f
id_id: KoreksiDahan = %.4f
ru_ru: ПоправкаНаРазмерДиска = %.4f

source: Corrected Altitude CorrectedAltitude = ApparentAltitude - RefractionCorrection - LimbCorrection CorrectedAltitude = %.4f - %.4f - %.4f CorrectedAltitude = %.4f
id_id: Ketinggian Dikoreksi KetinggianDikoreksi = KetinggianNampak- KoreksiRefraksi - KoreksiDahan KetinggianDikoreksi = %.4f - %.4f - %.4f KetinggianDikoreksi= %.4f
ru_ru: Истинная высота ИстиннаяВысота = ВидимаяВысота - ПоправкаРефракции - ПоправкаНаРазмерДиска ИстиннаяВысота = %.4f - %.4f - %.4f ИстиннаяВысота = %.4f

source: Sun selected, parallax correction rad = %.4f, HP = 0.002442/rad = %.4f
id_id: Matahari dipilih, koreksi parallaxs rad = %.4f, HP = 0.002442/rad = %.4f
ru_ru: Выбрано Солнце, коррекция параллакса rad = %.4f, HP = 0.002442/rad = %.4f

source: Moon selected, parallax correction HP = %.4f
id_id: Bulan dipilih, koreksi parallaxs HP = %.4f
ru_ru: Выбрана Луна, коррекция параллакса HP = %.4f

source: ParallaxCorrection = -180/Pi * asin( sin(Pi/180 * HP ) * cos(Pi/180 * CorrectedAltitude)) ParallaxCorrection = -180/Pi * asin( sin(Pi/180 * %.4f ) * cos(Pi/180 * %.4f)) ParallaxCorrection = %.4f
id_id: KoreksiParallaxs = -180/Pi * asin( sin(Pi/180 * HP ) * cos(Pi/180 * KetinggianDikoreksi)) KoreksiParallaxs = -180/Pi * asin( sin(Pi/180 * %.4f ) * cos(Pi/180 * %.4f)) KoreksiParallaxs = %.4f
ru_ru: КоррекцияПараллакса = -180/Pi * asin( sin(Pi/180 * HP ) * cos(Pi/180 * ИсправленнаяВысота)) КоррекцияПараллакса = -180/Pi * asin( sin(Pi/180 * %.4f ) * cos(Pi/180 * %.4f)) КоррекцияПараллакса = %.4f

source: Observed Altitude (Ho) ObservedAltitude = CorrectedAltitude - ParallaxCorrection ObservedAltitude = %.4f - %.4f ObservedAltitude = %.4f
id_id: Ketinggian Diamati (Ho) KetinggianDiamati = KetinggianDikoreksi - KoreksiParallaxs KetinggianDiamati = %.4f - %.4f KetinggianDiamati = %.4f
ru_ru: Видимая Высота (Ho) ВидимаяВысота = ИсправленнаяВысота - КоррекцияПараллакса ВидимаяВысота = %.4f - %.4f ВидимаяВысота = %.4f

source: Apparent Moon Altitude (Ha) ApparentAltitudeMoon = MeasurementMoon - IndexCorrection - EyeHeightCorrection ApparentAltitudeMoon = %.4f - %.4f - %.4f ApparentAltitudeMoon = %.4f
id_id: Ketinggian Bulan Yang Terlihat (Ha) Ketinggian Bulan = PengukuranBulan - KoreksiIndeks - KoreksiTinggiMata KetinggianBulan = %.4f - %.4f - %.4f KetinggianBulan = %.4f
ru_ru: Истинная Высота Луны (Ha) ИстиннаяВысотаЛуны = ИзмерениеЛуны - ПоправкаСекстанта - ИсправлениеВысотыГлаз ИстиннаяВысотаЛуны = %.4f - %.4f - %.4f ИстиннаяВысотаЛуны = %.4f

source: Refraction Correction x = tan(Pi/180*ApparentAltitudeMoon + 4.848e-2*(Pi/180) / (tan(Pi/180*ApparentAltitudeMoon) + .028)) x = tan(Pi/180*%.4f + 4.848e-2*(Pi/180) / (tan(Pi/180*%.4f) + .028)) x = %.4f
id_id: Koreksi Pembiasan x = tan(Pi/180*KetinggianBUlan + 4.848e-2*(Pi/180) / (tan(Pi/180*KetinggianBulan) + .028)) x = tan(Pi/180*%.4f + 4.848e-2*(Pi/180) / (tan(Pi/180*%.4f) + .028)) x = %.4f
ru_ru: Коррекция рефракции x = tan(Pi/180*ИстиннаяВысотаЛуны + 4.848e-2*(Pi/180) / (tan(Pi/180*ИстиннаяВысотаЛуны) + .028)) x = tan(Pi/180*%.4f + 4.848e-2*(Pi/180) / (tan(Pi/180*%.4f) + .028)) x = %.4f

source: RefractionCorrectionMoon = .267 * Pressure / (x*(Temperature + 273.15)) / 60.0 RefractionCorrectionMoon = .267 * %.4f / (x*(%.4f + 273.15)) / 60.0 RefractionCorrectionMoon = %.4f
id_id: KoreksiPembiasanBulan = .267 * Tekanan / (x*(Suhu + 273.15)) / 60.0 KoreksiPembiasanBulan = .267 * %.4f / (x*(%.4f + 273.15)) / 60.0 KoreksiPembiasanBulan = %.4f
ru_ru: КоррекцияРефракцииЛуны = .267 * Давление / (x*(Температура + 273.15)) / 60.0 КоррекцияРефракцииЛуны = .267 * %.4f / (x*(%.4f + 273.15)) / 60.0 КоррекцияРефракцииЛуны = %.4f

source: LimbCorrectionMoon = %.4f
id_id: LimbKoreksiBulan = %.4f
ru_ru: ПоправкаНаРазмерДискаЛуны = %.4f

source: Corrected Altitude CorrectedAltitudeMoon = ApparentAltitudeMoon - RefractionCorrectionMoon - LimbCorrectionMoon CorrectedAltitudeMoon = %.4f - %.4f - %.4f CorrectedAltitudeMoon = %.4f
id_id: KetinggianYangDikoreksi KoreksiKetinggianBulan = KetinggianBulan - KoreksiPembiasanBulan - LimbKoreksiBulan KoreksiKetinggianBulan = %.4f - %.4f - %.4f KoreksiKetinggianBulan = %.4f
ru_ru: ИсправленнаяВысота ИсправленнаяВысотаЛуны = ВидимаяВысотаЛуны - ПоправкаРефракцииЛуны - ПоправкаНаРазмерДискаЛуны ИсправленнаяВысотаЛуны = %.4f - %.4f - %.4f ИсправленнаяВысотаЛуны = %.4f

source: ParallaxCorrectionMoon = -180/Pi * asin( sin(Pi/180 * HP ) * cos(Pi/180 * CorrectedAltitude)) ParallaxCorrectionMoon = -180/Pi * asin( sin(Pi/180 * %.4f ) * cos(Pi/180 * %.4f)) ParallaxCorrectionMoon = %.4f
id_id: KoreksiParalaksBulan = -180/Pi * asin( sin(Pi/180 * HP ) * cos(Pi/180 * KoreksiKetinggian)) KoreksiParalaksBulan = -180/Pi * asin( sin(Pi/180 * %.4f ) * cos(Pi/180 * %.4f)) KoreksiParalaksBulan = %.4f
ru_ru: КоррекцияПараллаксаЛуны = -180/Pi * asin( sin(Pi/180 * HP ) * cos(Pi/180 * ИсправленнаяВысота)) КоррекцияПараллаксаЛуны = -180/Pi * asin( sin(Pi/180 * %.4f ) * cos(Pi/180 * %.4f)) КоррекцияПараллаксаЛуны = %.4f

source: Apparent Altitude (Ha) ApparentAltitude = Measurement - IndexCorrection - EyeHeightCorrection ApparentAltitude = %.4f - %.4f - %.4f ApparentAltitude = %.4f
id_id: Tampak Ketinggian (Ha) TampakKetinggian = Pengukuran - KoreksiIndeks - KoreksiKetinggianMata TampakKetinggian = %.4f - %.4f - %.4f TampakKetinggian = %.4f
ru_ru: ИстиннаяВысота (Ha) ИстиннаяВысота = Измерение - ПоправкаСекстанта - ИсправлениеВысотыГлаз ИстиннаяВысота = %.4f - %.4f - %.4f ИстиннаяВысота = %.4f

source: CorrectionsMoon = %.4f CorrectionsBody = %.4f Corrections = abs(CorrectionsMoon - CorrectionsBody) = %.4f
id_id: KoreksiBulan = %.4f KoreksiBadan = %.4f Koreksi = abs(KoreksiBulan - KoreksiBadan) = %.4f
ru_ru: ИсправленияЛунные = %.4f ИсправленияНебесногоТела = %.4f Исправления = abs(ИсправленияЛунные - ИсправленияНебесногоТела) = %.4f

source: CorrectedMeasurement = Measurement - Corrections - IndexCorrection CorrectedMeasurement = %.4f - %.4f - %.4f CorrectedMeasurement = %.4f
id_id: KoreksiPengukuran = Pengukuran - Koreksi - IndeksKoreksi KoreksiPengukuran = %.4f - %.4f - %.4f KoreksiPengukuran = %.4f
ru_ru: ИсправленноеИзмерение = Измерение - Исправления - ПоправкаСекстанта ИсправленноеИзмерение = %.4f - %.4f - %.4f ИсправленноеИзмерение = %.4f

source: Calculated angle between Moon and
id_id: Hitung sudut antara Bulan dan
ru_ru: Рассчитанный угол между Луной и

source: Error from measurement: %.4f
id_id: Kesalahan dari pengukuran: %.4f
ru_ru: Ошибка измерения: %.4f

source: Moon takes 28 days to orbit, one degree of error takes 6720 seconds
id_id: Bulan memakan waktu 28 hari untuk mengorbit, satu tingkat kesalahan mengambil 6720 detik
ru_ru: Оборот Луны 28 дней, один градус ошибки накапливается за - 6720 секунд

source: Time correction %.4f seconds
id_id: Koreksi waktu %.4f detik
ru_ru: Коррекция времени %.4f секунд

source: Building bearing Sight Positions
id_id: Bangunan bantalan Posisi Penglihatan
ru_ru: Строим позиции азимутов наблюдения

source: Measurement certainty likely set to small, sight may not appear
id_id: Kepastian pengukuran kemungkinan kecil, penglihatan mungkin tidak muncul
ru_ru: Точность определения места скорее всего установлена малой, азимуты наблюдения могут не отображаться

source: Warning
id_id: Peringatan
ru_ru: Внимание

source: Lunar shot will be invalid taking distance from moon to itself
id_id: Tembakan Lunar tidak akan mungkin mengambil jarak dari bulan ke dirinya sendiri
ru_ru: Измерение дистанции от Луны до самой себя неверно

source: Failed to load file:
id_id: Gagal Memuat File:
ru_ru: Не удалось загрузить файл:

source: Magnetic data will not be available for the celestial navigation plugin.
id_id: Data magnetik tidak akan tersedia untuk plugin navigasi angkasa.
ru_ru: Магнитные данные не будут доступны для плагина астронавигации.

source: OpenCPN Alert
id_id: Peringatan OpenCPN
ru_ru: OpenCPN — Предупреждение

source: Celestial Navigation PlugIn for OpenCPN
id_id: Plugin Navigasi langit untuk OpenCPN
ru_ru: Плагин астронавигации для OpenCPN

source: Celestial Navigation PlugIn for OpenCPN. Implements nautical almanac for sun, moon, planets, and various navigational stars. Compute position fix from celestial measurements.
id_id: Navigasi Langit Plugin untuk OpenCPN. implementasi almanak bahari untuk matahari, bulan, planet, dan berbagai bintang navigasi. Hitung posisi fix dari pengukuran selestial.
ru_ru: Плагин астронавигации для OpenCPN. Включает альманахи Солнца, Луны, планет и навигационных звёзд. Расчет определения места по астрометрии.

source: Shifted sights are not used to compute a fix, determine fix visually instead.
id_id: Pemandangan yang digeser tidak digunakan untuk menghitung fix, tentukan perbaikan secara visual.
ru_ru: Данные дистанционных наблюдений не используются для исправления ошибки счисления, вместо этого определите ошибку визуально.

source: Fix Position
id_id: Memperbaiki posisi
ru_ru: Исправить место

source: N/A
ru_ru: Н/Д

source: Celestial_Navigation_Information.html
id_id: Informasi_Navigasi_Angkasa.html

source: MyLabel
id_id: Label saya
